In [1]:
%run py_import.py

### 1. 删除重复值

In [2]:
data = pd.DataFrame({
    'k1':['one','two'] * 3 + ['two'],
    'k2':[1,1,2,3,3,4,4]
})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()   # 返回的是一个布尔值Series

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()  # 返回一个不含重复行的DataFrame

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data['v1'] = range(7)

In [7]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [8]:
data.drop_duplicates(['k1','k2'],keep = 'last')   # duplicated和drop_duplicates默认都是保留第一个观测到的值

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 2. 使用函数或映射进行数据转换

In [9]:
data1 = pd.DataFrame({
    'food':['bacon','pulled pork','bacon',
            'Pastrami','corned beef','Bacon',
            'pastrami','honey ham','nova lox'],
    'ounces':[4,3,12,6,7.5,8,3,5,6]
})

In [10]:
data1

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [11]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'cornded beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [12]:
lowercased = data1['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [13]:
data1['animal'] = lowercased.map(meat_to_animal)    #map接收一个函数或者一个包含映射关系的字典型对象

In [14]:
data1

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     NaN
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### 3. 替代值

**replace修改一个对象中子集的值**

In [15]:
data2 = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data2

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [16]:
data2.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [17]:
data2.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [18]:
data2.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [19]:
data2.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 4. 重命名轴索引

In [20]:
data3 = pd.DataFrame(np.arange(12).reshape(3,4), 
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one','two','three','four'])

In [21]:
data3

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [22]:
transform = lambda x:x[:4].upper()

In [23]:
data3.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [24]:
data3.index = data3.index.map(transform)

In [25]:
data3

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### 5. 离散化和分箱

**分组**

In [26]:
ages = [20, 22 ,25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [27]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [28]:
cats    # 返回值是特殊的Categorical对象

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [29]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [30]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [31]:
pd.value_counts(cats)   # 对pd.cut的结果进行计数

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [32]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)   # 通过向labes选项传递一个列表或数组来传入自定义箱名

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [33]:
data4 = np.random.rand(20)

In [34]:
pd.cut(data4, 4, precision = 2)   # 均匀分布的数据切成四份， precision = 2 保留两位小数

[(0.51, 0.74], (0.51, 0.74], (0.058, 0.29], (0.74, 0.97], (0.058, 0.29], ..., (0.74, 0.97], (0.74, 0.97], (0.29, 0.51], (0.74, 0.97], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.058, 0.29] < (0.29, 0.51] < (0.51, 0.74] < (0.74, 0.97]]

**qcut**

In [35]:
data5 = np.random.randn(1000)   # 生成标准正态分布随机数

In [36]:
cats1 = pd.qcut(data5, 4)

In [37]:
cats1

[(-0.661, -0.0254], (-3.67, -0.661], (0.696, 3.171], (-0.0254, 0.696], (0.696, 3.171], ..., (0.696, 3.171], (0.696, 3.171], (-0.661, -0.0254], (-0.661, -0.0254], (-3.67, -0.661]]
Length: 1000
Categories (4, interval[float64]): [(-3.67, -0.661] < (-0.661, -0.0254] < (-0.0254, 0.696] < (0.696, 3.171]]

### 6. 检测和过滤异常值

In [39]:
data6 = pd.DataFrame(np.random.randn(1000, 4))

In [40]:
data6.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.012501    -0.003539    -0.009833     0.000571
std       0.975175     0.994841     0.986303     0.968223
min      -2.914214    -3.041797    -3.585022    -3.115829
25%      -0.704732    -0.692437    -0.665706    -0.608562
50%      -0.006978     0.037947    -0.030140     0.010703
75%       0.648091     0.683322     0.648417     0.643801
max       3.161476     2.706250     3.027089     2.896377

In [41]:
col = data6[2]
col[np.abs(col) > 3]

373   -3.585022
554    3.027089
Name: 2, dtype: float64

### 7. 置换和随机取样

**使用numpy.random.permutation对Series进行随机重排序**

In [58]:
df = pd.DataFrame(np.arange(20).reshape(5, 4))

In [47]:
sampler = np.random.permutation(5)

In [48]:
sampler    # 返回新的序列

array([4, 0, 2, 1, 3])

In [51]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [52]:
df.take(sampler)   # 重新排序

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

### 8.计算指标/虚拟变量

In [56]:
df1 = pd.DataFrame({
    'key':['b','b','a','c','a','b'],
    'data1':range(6)
})

In [60]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [62]:
pd.get_dummies(df1['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0